
      ******************************************************************
      * Author:    Oscar Brink
      * Date:      2018-10-25
      * Purpose:   Calculates harvest for HAMMURABI-GAME using random
      *            value between 1 and 6.
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
           PROGRAM-ID. CALCULATE-POPULATION.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
           LINKAGE SECTION.
               01 LS-PLANTED-ACRES PIC 9(7).

       PROCEDURE DIVISION
       EXIT PROGRAM.

