      ******************************************************************
      * Author:    Oscar Brink
      * Date:      2018-02-12
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
           PROGRAM-ID. YOUR-PROGRAM.
       DATA DIVISION.
           WORKING-STORAGE SECTION.

           LINKAGE SECTION.
               01 LS-PRICE PIC 99.
               01 LS-AMOUNT PIC S9(7).
               01 LS-CURRENT-WHEAT PIC 9(7).
               01 LS-ACRES PIC 9(7).
       PROCEDURE DIVISION.
           MAIN-PROCEDURE.

       EXIT PROGRAM.
